Sguan-ZhouQing/Qiansai25_MainCode/项目工程文件/demo_STM32F407code/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define G431_Control_Pin GPIO_PIN_2
#define G431_Control_GPIO_Port GPIOC
#define TianWen_OUT_Pin GPIO_PIN_3
#define TianWen_OUT_GPIO_Port GPIOC
#define CTP_RST_Pin GPIO_PIN_5
#define CTP_RST_GPIO_Port GPIOC
#define CTP_INT_Pin GPIO_PIN_1
#define CTP_INT_GPIO_Port GPIOB
#define LCD_RST_Pin GPIO_PIN_12
#define LCD_RST_GPIO_Port GPIOB
#define LCD_RS_Pin GPIO_PIN_14
#define LCD_RS_GPIO_Port GPIOB
#define LCD_CS_Pin GPIO_PIN_15
#define LCD_CS_GPIO_Port GPIOB
#define HLK_OUT_Pin GPIO_PIN_10
#define HLK_OUT_GPIO_Port GPIOD
#define Infrared_Pin GPIO_PIN_11
#define Infrared_GPIO_Port GPIOD
#define Button1_Pin GPIO_PIN_12
#define Button1_GPIO_Port GPIOD
#define Button2_Pin GPIO_PIN_13
#define Button2_GPIO_Port GPIOD
#define Button3_Pin GPIO_PIN_14
#define Button3_GPIO_Port GPIOD
#define Beef_IO_Pin GPIO_PIN_15
#define Beef_IO_GPIO_Port GPIOD
#define CE_Pin GPIO_PIN_2
#define CE_GPIO_Port GPIOD
#define CSN_Pin GPIO_PIN_3
#define CSN_GPIO_Port GPIOD
#define IRQ_Pin GPIO_PIN_4
#define IRQ_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
